Tekla Open API Reference for Tekla Structures 2025
Model Class
 The Model class represents a single model open in Tekla Structures. Before interaction with the model, the user will have to create one instance of this class.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Model
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class Model
<SerializableAttribute>
Public NotInheritable Class Model
The Model type exposes the following members.
Constructors
Name | Description
Model
 Creates a "handle" to the currently open model.
Top
Methods
Name | Description
CommitChanges()
 Commits the changes made to the model database so far. One commit is something that a user can later on undo with the undo command. A commit also launches the drawing of the changed product model to the visible views. A dependent plug-in should never call CommitChanges, since this would make undo very difficult for the user to do. However, non-dependent plug-ins require a separate commit if new objects are created.
CommitChanges(String)
 Commits the changes made to the model database so far. One commit is something that a user can later on undo with the undo command. A commit also launches the drawing of the changed product model to the visible views. A plug-in should never call CommitChanges, since this would make undo very difficult for the user to do.
FetchModelObjects(List<String>, Boolean)
 Fetches a list of modelobjects based on given guid list of objects, checks if guid is native or external (for reference model object) and optionally selects objects before returning them.
FetchModelObjects(List<Identifier>, Boolean)
 Fetches a list of modelobjects based on given identifier list of objects, and optionally selects objects before returning them.
GetClashCheckHandler
 Returns a new clash check handler.
GetConnectionStatus
 Returns true if a proper connection to the Tekla Structures process has been established. Currently, there's no way to re-establish the connection.
GetGUIDByIdentifier
 Returns the GUID of the given identifier instance.
GetIdentifierByGUID
 Returns an identifier instance that has the given GUID in the model.
GetInfo
 Returns information about the currently open model.
GetModelObjectSelector
 Returns a ModelObjectSelector instance from which different kind of selections can be made.
GetPhases
 Returns information about the current model's phases.
GetProjectInfo
 Returns information about the current model's project.
GetReportPropertyDouble
 Get a list of property values, where the property is of type double, for the given identifiers.
GetReportPropertyInt
 Get a list of property values, where the property is of type interger, for the given identifiers.
GetReportPropertyStr
 Get a list of property values, where the property is of type string, for the given identifiers.
GetWorkPlaneHandler
 Returns a new work plane handler for the model. The work plane handler can be used to manipulate the current work plane in the model.
SelectModelObject
 Takes as input an identifier to an object and then checks its type and instantiates and selects it before returning it.
Top
See Also
Reference
Tekla.Structures.Model Namespace